# FamilyKeywordProtected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyKeywordProtected Property
ParameterTypeId Class See Also
---
"Content protection enabled"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyKeywordProtected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyKeywordProtected As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyKeywordProtected {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace